Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
#include "GSignalFlow.h"

#include "FpgaLink.h"
#include "GMeasurementCalibration.h"
#include "SpectrumAnalyzer.h"
#include "GSerial.h"
#include "tjc_usart_hmi.h"
#include "stm32f4xx_hal.h"

#include <stdio.h>
#include <string.h>

#define G_FLOW_STATUS_POLL_MS       2U
#define G_FLOW_UART_TIMEOUT_MS      50U
#define G_FLOW_RESPONSE_LIMIT_MS    2000U
#define G_FLOW_ASCII_DEBUG_ENABLED   1U
#define G_FLOW_HMI_IDLE_REFRESH_MS  2000U
#define G_FLOW_HMI_MEASUREMENT_FIELDS 9U
#define G_FLOW_HMI_BUSY_MIN_MS        300U
#define G_FLOW_CAPTURE_TIMEOUT_MS     2000U
#define G_FLOW_WAVE_HEIGHT_DIVISOR    3U
#define G_FLOW_WAVE_VERTICAL_OFFSET   20U
#define G_FLOW_WAVE_FALLBACK_POINTS   512U
#define G_FLOW_WAVE_MAX_POINTS        1024U

typedef enum
{
    G_FLOW_STATE_IDLE = 0,
    G_FLOW_STATE_WAIT_ANALYSIS,
    G_FLOW_STATE_WAIT_WAVEFORM,
    G_FLOW_STATE_WAIT_RESTART,
    G_FLOW_STATE_HOLD
} GFlowState;

static int16_t s_CaptureFrame[SPECTRUM_FRAME_LENGTH];
static SpectrumResult s_Result;
static GMeasurementResult s_Measurement;
static GMeasurementWaveform s_Waveform;
static GFlowState s_State;
static uint32_t s_NextActionTick;
static uint32_t s_ReportSequence;
static uint32_t s_ActiveSequence;
static uint32_t s_CycleStartTick;
static uint32_t s_AnalysisElapsedMs;
static uint32_t s_FpgaId;
static uint32_t s_NextIdleHmiTextTick;
static uint8_t s_FpgaOnline;
static uint8_t s_WaveformCycles;
static uint8_t s_MeasurementEnabled;
static uint8_t s_HmiMeasurementField;
static uint8_t s_HmiMeasurementPending;
static uint8_t s_HmiReadyPending;
static uint32_t s_HmiBusyUntilTick;
static uint16_t s_WaveDisplayPoints;
static uint8_t s_WaveDisplay[G_FLOW_WAVE_MAX_POINTS];

static void GSignalFlow_SendText(const char *text);
static void GSignalFlow_SendStartup(void);
static void GSignalFlow_SendError(const char *stage);
static void GSignalFlow_SendNoSignal(void);
static void GSignalFlow_SendResult(void);
static uint8_t GSignalFlow_SendMeasurement(void);
static uint32_t GSignalFlow_RoundPositive(float value);
static void GSignalFlow_StartOrRetry(uint32_t now);
static void GSignalFlow_FinishCycle(uint32_t now);
static void GSignalFlow_AbortCycle(const char *stage,
                                  const char *hmi_status);
static void GSignalFlow_HandleCommand(void);
static void GSignalFlow_UpdateHmiPlaceholders(void);
static void GSignalFlow_QueueHmiMeasurement(void);
static void GSignalFlow_ServiceHmiMeasurement(void);
static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field);
static void GSignalFlow_UpdateHmiNoSignal(void);
static void GSignalFlow_UpdateHmiWaveform(void);

void GSignalFlow_Init(void)
{
    memset(s_CaptureFrame, 0, sizeof(s_CaptureFrame));
    memset(&s_Result, 0, sizeof(s_Result));
    memset(&s_Measurement, 0, sizeof(s_Measurement));
    memset(&s_Waveform, 0, sizeof(s_Waveform));
    memset(s_WaveDisplay, 0, sizeof(s_WaveDisplay));
    s_State = G_FLOW_STATE_IDLE;
    s_NextActionTick = HAL_GetTick();
    s_ReportSequence = 0UL;
    s_ActiveSequence = 0UL;
    s_CycleStartTick = HAL_GetTick();
    s_AnalysisElapsedMs = 0UL;
    s_FpgaId = 0UL;
    s_NextIdleHmiTextTick = HAL_GetTick();
    s_WaveformCycles = 1U;
    s_MeasurementEnabled = 0U;
    s_HmiMeasurementField = 0U;
    s_HmiMeasurementPending = 0U;
    s_HmiReadyPending = 0U;
    s_HmiBusyUntilTick = 0UL;
    s_WaveDisplayPoints = 0U;

    TjcHmi_Init();

    FpgaLink_Init();
    s_FpgaOnline = Fpga_ReadId(&s_FpgaId);
    GSignalFlow_SendStartup();
}

void GSignalFlow_Process(void)
{
    uint32_t now = HAL_GetTick();

    GSignalFlow_HandleCommand();
    GSignalFlow_ServiceHmiMeasurement();

    if (s_State == G_FLOW_STATE_IDLE)
    {
        /*
         * 屏幕上电通常慢于MCU。开始测量前每2秒重发一次XXX占位文字，
         * 避免第一次命令发送过早后仍显示工程里的默认newtxt。
         */
        if ((int32_t)(now - s_NextIdleHmiTextTick) >= 0)
        {
            GSignalFlow_UpdateHmiPlaceholders();
            TjcHmi_SetComputeBusy(0U);
            s_NextIdleHmiTextTick = now + G_FLOW_HMI_IDLE_REFRESH_MS;
        }
        return;
    }

    /* 单次测量完成后保持本轮结果，直到再次按下“开始测量”。 */
    if (s_State == G_FLOW_STATE_HOLD)
    {
        return;
    }

    if ((int32_t)(now - s_NextActionTick) < 0)
    {
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_RESTART)
    {
        GSignalFlow_StartOrRetry(now);
        return;
    }

    {
        uint32_t status = 0UL;

        if (Fpga_ReadCaptureStatus(&status) == 0U)
        {
            GSignalFlow_AbortCycle("status", "STAT ERR");
            return;
        }

        if ((status & FPGA_CAPTURE_STATUS_DONE) == 0UL)
        {
            if ((uint32_t)(now - s_CycleStartTick) >=
                G_FLOW_CAPTURE_TIMEOUT_MS)
            {
                GSignalFlow_AbortCycle("timeout", "TIMEOUT");
                return;
            }
            s_NextActionTick = now + G_FLOW_STATUS_POLL_MS;
            return;
        }

        if ((uint16_t)(status >> 16U) != FPGA_CAPTURE_FRAME_LENGTH)
        {
            GSignalFlow_AbortCycle("length", "LEN ERR");
            return;
        }
    }

    if (Fpga_ReadCaptureFrame(s_CaptureFrame, SPECTRUM_FRAME_LENGTH) == 0U)
    {
        GSignalFlow_AbortCycle("frame", "FRAME ERR");
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_ANALYSIS)
    {
        if (SpectrumAnalyzer_Run(s_CaptureFrame, &s_Result) == 0U)
        {
            if (s_Result.status == SPECTRUM_STATUS_NO_SIGNAL)
            {
                s_ActiveSequence = s_ReportSequence;
                s_ReportSequence++;
                s_AnalysisElapsedMs = HAL_GetTick() - s_CycleStartTick;
                GSignalFlow_SendNoSignal();
                GSignalFlow_UpdateHmiNoSignal();
            }
            else
            {
                GSignalFlow_AbortCycle("spectrum", "CALC ERR");
                return;
            }
            GSignalFlow_FinishCycle(HAL_GetTick());
            return;
        }

        s_ActiveSequence = s_ReportSequence;
        s_ReportSequence++;
        s_AnalysisElapsedMs = HAL_GetTick() - s_CycleStartTick;
        GSignalFlow_SendResult();
        if (GSignalFlow_SendMeasurement() == 0U)
        {
            GSignalFlow_AbortCycle("measurement", "CALC ERR");
            return;
        }

        if (Fpga_StartCapture(1U) == 0U)
        {
            GSignalFlow_AbortCycle("wave_start", "WAVE ERR");
            return;
        }

        s_State = G_FLOW_STATE_WAIT_WAVEFORM;
        s_NextActionTick = HAL_GetTick() + G_FLOW_STATUS_POLL_MS;
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_WAVEFORM)
    {
        if (GMeasurement_BuildWaveform(
                s_CaptureFrame,
                SPECTRUM_FRAME_LENGTH,
                G_MEASUREMENT_WAVEFORM_SAMPLE_RATE_HZ,
                s_Result.fundamental_hz,
                s_WaveformCycles,
                &s_Waveform) == 0U)
        {
            GSignalFlow_AbortCycle("waveform", "WAVE ERR");
            return;
        }

        GSignalFlow_UpdateHmiWaveform();
        GSignalFlow_FinishCycle(HAL_GetTick());
        return;
    }
}

