Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
static void GSignalFlow_StartOrRetry(uint32_t now)
{
    /* 没有收到明确的开始按键事件时，任何路径都不得启动FPGA采集。 */
    if (s_MeasurementEnabled == 0U)
    {
        s_State = G_FLOW_STATE_IDLE;
        return;
    }

    if (s_FpgaOnline == 0U)
    {
        s_FpgaOnline = Fpga_ReadId(&s_FpgaId);
        if (s_FpgaOnline == 0U)
        {
            GSignalFlow_AbortCycle("id", "ID ERR");
            return;
        }
    }

    if (Fpga_StartCapture(0U) == 0U)
    {
        GSignalFlow_AbortCycle("start", "START ERR");
        return;
    }

    memset(&s_Result, 0, sizeof(s_Result));
    memset(&s_Measurement, 0, sizeof(s_Measurement));
    memset(&s_Waveform, 0, sizeof(s_Waveform));
    s_CycleStartTick = now;
    s_State = G_FLOW_STATE_WAIT_ANALYSIS;
    s_NextActionTick = now + G_FLOW_STATUS_POLL_MS;
}

static void GSignalFlow_FinishCycle(uint32_t now)
{
    (void)now;
    s_MeasurementEnabled = 0U;
    s_State = G_FLOW_STATE_HOLD;
    s_HmiReadyPending = 1U;
}

static void GSignalFlow_AbortCycle(const char *stage,
                                  const char *hmi_status)
{
    GSignalFlow_SendError(stage);
    s_MeasurementEnabled = 0U;
    s_HmiMeasurementPending = 0U;
    s_HmiReadyPending = 0U;
    s_State = G_FLOW_STATE_HOLD;
    TjcHmi_SetStatusText(hmi_status);
}

static void GSignalFlow_HandleCommand(void)
{
    TjcHmiEvent event;
    uint8_t ignored_cycles = 0U;

    if (TjcHmi_ReadEvent(&event, &ignored_cycles) == 0U)
    {
        return;
    }

    if (event == TJC_HMI_EVENT_START_MEASUREMENT)
    {
        GSignalFlow_SendText("G_HMI,event=start\r\n");
        TjcHmi_SetComputeBusy(1U);
        s_HmiBusyUntilTick = HAL_GetTick() + G_FLOW_HMI_BUSY_MIN_MS;
        s_HmiReadyPending = 1U;
        s_MeasurementEnabled = 1U;
        if ((s_State == G_FLOW_STATE_IDLE) ||
            (s_State == G_FLOW_STATE_HOLD))
        {
            s_HmiMeasurementPending = 0U;
            s_State = G_FLOW_STATE_WAIT_RESTART;
            s_NextActionTick = HAL_GetTick();
        }
        return;
    }

    if (event == TJC_HMI_EVENT_TOGGLE_CYCLES)
    {
        ignored_cycles = (s_WaveformCycles == 1U) ? 3U : 1U;
    }

    if ((event == TJC_HMI_EVENT_TOGGLE_CYCLES) ||
        (event == TJC_HMI_EVENT_SET_CYCLES))
    {
        (void)GSignalFlow_SetWaveformCycles(ignored_cycles);
    }
}

static void GSignalFlow_SendText(const char *text)
{
#if G_FLOW_ASCII_DEBUG_ENABLED != 0U
    size_t length;

    if (text == NULL)
    {
        return;
    }

    length = strlen(text);
    if (length > 0xFFFFU)
    {
        length = 0xFFFFU;
    }

    (void)GSerial_Transmit((const uint8_t *)text,
                           (uint16_t)length,
                           G_FLOW_UART_TIMEOUT_MS);
#else
    (void)text;
#endif
}

static void GSignalFlow_SendStartup(void)
{
    char buffer[96];

    (void)snprintf(buffer,
                   sizeof(buffer),
                   "G_FLOW,boot,id=0x%08lX,online=%u,fs=1250000,n=4096\r\n",
                   (unsigned long)s_FpgaId,
                   (unsigned int)s_FpgaOnline);
    GSignalFlow_SendText(buffer);
}

static void GSignalFlow_SendError(const char *stage)
{
    char buffer[96];

    (void)snprintf(buffer,
                   sizeof(buffer),
                   "G_FLOW,error=%s,seq=%lu\r\n",
                   stage,
                   (unsigned long)s_ReportSequence);
    GSignalFlow_SendText(buffer);
}

static void GSignalFlow_SendNoSignal(void)
{
    char buffer[128];

    (void)snprintf(
        buffer,
        sizeof(buffer),
        "G_FLOW,no_signal,seq=%lu,t_ms=%lu,under2s=%u,threshold=%u\r\n",
        (unsigned long)s_ActiveSequence,
        (unsigned long)s_AnalysisElapsedMs,
        (unsigned int)((s_AnalysisElapsedMs <=
                        G_FLOW_RESPONSE_LIMIT_MS) ? 1U : 0U),
        (unsigned int)SPECTRUM_MIN_VALID_AMPLITUDE_CODES);
    GSignalFlow_SendText(buffer);
}

static void GSignalFlow_SendResult(void)
{
    char buffer[256];
    int written;
    uint8_t component;

    written = snprintf(buffer,
                       sizeof(buffer),
                       "G_FLOW,seq=%lu,f0=%luHz,n=%u,rms=%lu,vpp=%lu,t_ms=%lu,under2s=%u",
                       (unsigned long)s_ActiveSequence,
                       (unsigned long)GSignalFlow_RoundPositive(s_Result.fundamental_hz),
                       (unsigned int)s_Result.component_count,
                       (unsigned long)GSignalFlow_RoundPositive(s_Result.rms_codes),
                       (unsigned long)GSignalFlow_RoundPositive(s_Result.vpp_codes),
                       (unsigned long)s_AnalysisElapsedMs,
                       (unsigned int)((s_AnalysisElapsedMs <=
                                       G_FLOW_RESPONSE_LIMIT_MS) ? 1U : 0U));

    if (written < 0)
    {
        return;
    }

    for (component = 0U;
         (component < s_Result.component_count) &&
         ((size_t)written < sizeof(buffer));
         component++)
    {
        const SpectrumComponent *item = &s_Result.components[component];
        int appended = snprintf(&buffer[written],
                                sizeof(buffer) - (size_t)written,
                                ",h%u=%luHz:%lu",
                                (unsigned int)item->harmonic,
                                (unsigned long)GSignalFlow_RoundPositive(item->frequency_hz),
                                (unsigned long)GSignalFlow_RoundPositive(item->amplitude_codes));

        if (appended < 0)
        {
            break;
        }

        if ((size_t)appended >= sizeof(buffer) - (size_t)written)
        {
            written = (int)(sizeof(buffer) - 1U);
            break;
        }

        written += appended;
    }

    if ((size_t)written < sizeof(buffer))
    {
        int appended;

        if (s_Result.spur_valid != 0U)
        {
            appended = snprintf(&buffer[written],
                                sizeof(buffer) - (size_t)written,
                                ",spur=%luHz:%lu",
                                (unsigned long)GSignalFlow_RoundPositive(
                                    s_Result.spur_frequency_hz),
                                (unsigned long)GSignalFlow_RoundPositive(
                                    s_Result.spur_amplitude_codes));
        }
        else
        {
            appended = snprintf(&buffer[written],
                                sizeof(buffer) - (size_t)written,
                                ",spur=none");
        }

        if (appended >= 0)
        {
            if ((size_t)appended >=
                sizeof(buffer) - (size_t)written)
            {
                written = (int)(sizeof(buffer) - 1U);
            }
            else
            {
                written += appended;
            }
        }
    }

    if ((size_t)written + 2U < sizeof(buffer))
    {
        buffer[written++] = '\r';
        buffer[written++] = '\n';
        buffer[written] = '\0';
    }
    else
    {
        buffer[sizeof(buffer) - 3U] = '\r';
        buffer[sizeof(buffer) - 2U] = '\n';
        buffer[sizeof(buffer) - 1U] = '\0';
    }

