Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    GSignalFlow_SendText(buffer);
}

static uint8_t GSignalFlow_SendMeasurement(void)
{
    char buffer[256];
    int written;
    uint8_t component;

    if (GMeasurement_Convert(&s_Result,
                             GMeasurementCalibration_Get(),
                             &s_Measurement) == 0U)
    {
        (void)snprintf(buffer,
                       sizeof(buffer),
                       "G_MEAS,seq=%lu,cal=0,reason=no_mv_table\r\n",
                       (unsigned long)s_ActiveSequence);
        GSignalFlow_SendText(buffer);
        return 0U;
    }

    GSignalFlow_QueueHmiMeasurement();

    written = snprintf(
        buffer,
        sizeof(buffer),
        "G_MEAS,seq=%lu,cal=1,f0=%luHz,upp=%lumV,urms=%lumV,n=%u",
        (unsigned long)s_ActiveSequence,
        (unsigned long)GSignalFlow_RoundPositive(
            s_Measurement.fundamental_hz),
        (unsigned long)GSignalFlow_RoundPositive(s_Measurement.upp_mv),
        (unsigned long)GSignalFlow_RoundPositive(s_Measurement.urms_mv),
        (unsigned int)s_Measurement.component_count);

    if (written < 0)
    {
        return 0U;
    }

    for (component = 0U;
         (component < s_Measurement.component_count) &&
         ((size_t)written < sizeof(buffer));
         component++)
    {
        const GMeasurementComponent *item =
            &s_Measurement.components[component];
        int appended = snprintf(
            &buffer[written],
            sizeof(buffer) - (size_t)written,
            ",h%u=%luHz:%lumV",
            (unsigned int)item->harmonic,
            (unsigned long)GSignalFlow_RoundPositive(item->frequency_hz),
            (unsigned long)GSignalFlow_RoundPositive(item->amplitude_mv));

        if (appended < 0)
        {
            break;
        }
        if ((size_t)appended >= sizeof(buffer) - (size_t)written)
        {
            written = (int)(sizeof(buffer) - 1U);
            break;
        }
        written += appended;
    }

    if ((size_t)written + 2U < sizeof(buffer))
    {
        buffer[written++] = '\r';
        buffer[written++] = '\n';
        buffer[written] = '\0';
    }
    else
    {
        buffer[sizeof(buffer) - 3U] = '\r';
        buffer[sizeof(buffer) - 2U] = '\n';
        buffer[sizeof(buffer) - 1U] = '\0';
    }

    GSignalFlow_SendText(buffer);
    return 1U;
}

static void GSignalFlow_QueueHmiMeasurement(void)
{
    /* 三个主要参数先立即显示，确保后续波形采集不会拖住Urms。 */
    GSignalFlow_UpdateHmiMeasurementField(0U);
    GSignalFlow_UpdateHmiMeasurementField(1U);
    GSignalFlow_UpdateHmiMeasurementField(2U);
    s_HmiMeasurementField = 3U;
    s_HmiMeasurementPending = 1U;
}

/* 每次主循环最多更新一个文本控件，避免参数集中成批发送。 */
static void GSignalFlow_ServiceHmiMeasurement(void)
{
    if (s_HmiMeasurementPending != 0U)
    {
        GSignalFlow_UpdateHmiMeasurementField(s_HmiMeasurementField);
        s_HmiMeasurementField++;

        if (s_HmiMeasurementField >= G_FLOW_HMI_MEASUREMENT_FIELDS)
        {
            s_HmiMeasurementPending = 0U;
        }
        return;
    }

    if ((s_HmiReadyPending != 0U) &&
        (s_State == G_FLOW_STATE_HOLD) &&
        ((int32_t)(HAL_GetTick() - s_HmiBusyUntilTick) >= 0))
    {
        TjcHmi_SetComputeBusy(0U);
        s_HmiReadyPending = 0U;
    }
}

static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field)
{
    char text[40];
    uint8_t component;
    const char *object_name;

    if (field == 0U)
    {
        (void)snprintf(text,
                       sizeof(text),
                       "f0=%lu Hz",
                       (unsigned long)GSignalFlow_RoundPositive(
                           s_Measurement.fundamental_hz));
        tjc_send_txt("t0", "txt", text);
        return;
    }
    if (field == 1U)
    {
        (void)snprintf(text,
                       sizeof(text),
                       "Vpp=%lu mV",
                       (unsigned long)GSignalFlow_RoundPositive(
                           s_Measurement.upp_mv));
        tjc_send_txt("t1", "txt", text);
        return;
    }
    if (field == 2U)
    {
        (void)snprintf(text,
                       sizeof(text),
                       "Urms=%lu mV",
                       (unsigned long)GSignalFlow_RoundPositive(
                           s_Measurement.urms_mv));
        tjc_send_txt("t2", "txt", text);
        return;
    }

    if (field <= 5U)
    {
        component = (uint8_t)(field - 3U);
        object_name = (field == 3U) ? "t3" :
                      ((field == 4U) ? "t4" : "t5");

        if (component < s_Measurement.component_count)
        {
            const GMeasurementComponent *item =
                &s_Measurement.components[component];
            (void)snprintf(text,
                           sizeof(text),
                           "C%u=H%u,%lu Hz,%lu mV",
                           (unsigned int)(component + 1U),
                           (unsigned int)item->harmonic,
                           (unsigned long)GSignalFlow_RoundPositive(
                               item->frequency_hz),
                           (unsigned long)GSignalFlow_RoundPositive(
                               item->amplitude_mv));
        }
        else
        {
            (void)snprintf(text,
                           sizeof(text),
                           "C%u=XXX",
                           (unsigned int)(component + 1U));
        }
        tjc_send_txt(object_name, "txt", text);
        return;
    }

    if (field < G_FLOW_HMI_MEASUREMENT_FIELDS)
    {
        uint8_t harmonic = (uint8_t)(field - 5U);
        const GMeasurementComponent *matched = NULL;
        char harmonic_object[3] =
            {'t', (char)('5' + harmonic), '\0'};

        for (component = 0U;
             component < s_Measurement.component_count;
             component++)
        {
            if (s_Measurement.components[component].harmonic == harmonic)
            {
                matched = &s_Measurement.components[component];
                break;
            }
        }

        if (matched != NULL)
        {
            (void)snprintf(text,
                           sizeof(text),
                           "H%u=%lu mV",
                           (unsigned int)harmonic,
                           (unsigned long)GSignalFlow_RoundPositive(
                               matched->amplitude_mv));
        }
        else
        {
            (void)snprintf(text,
                           sizeof(text),
                           "H%u=XXX mV",
                           (unsigned int)harmonic);
        }
        tjc_send_txt(harmonic_object, "txt", text);
    }
}

static void GSignalFlow_UpdateHmiPlaceholders(void)
{
    uint8_t field;
    uint8_t harmonic;

    tjc_send_txt("t0", "txt", "f0=XXX Hz");
    tjc_send_txt("t1", "txt", "Vpp=XXX mV");
    tjc_send_txt("t2", "txt", "Urms=XXX mV");
    for (field = 3U; field <= 5U; field++)
    {
        char object_name[3] = {'t', (char)('0' + field), '\0'};
        char text[12];

