Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
        (void)snprintf(text,
                       sizeof(text),
                       "C%u=XXX",
                       (unsigned int)(field - 2U));
        tjc_send_txt(object_name, "txt", text);
    }
    for (harmonic = 1U; harmonic <= 3U; harmonic++)
    {
        char object_name[3] =
            {'t', (char)('5' + harmonic), '\0'};
        char text[20];

        (void)snprintf(text,
                       sizeof(text),
                       "H%u=XXX mV",
                       (unsigned int)harmonic);
        tjc_send_txt(object_name, "txt", text);
    }
}

static void GSignalFlow_UpdateHmiNoSignal(void)
{
    s_HmiMeasurementPending = 0U;
    GSignalFlow_UpdateHmiPlaceholders();
}

static void GSignalFlow_UpdateHmiWaveform(void)
{
    int32_t minimum;
    int32_t range;
    uint16_t point;
    uint16_t display_points = s_WaveDisplayPoints;

    if ((s_Waveform.valid == 0U) ||
        (s_Waveform.point_count != G_MEASUREMENT_WAVEFORM_POINTS))
    {
        return;
    }

    minimum = (int32_t)s_Waveform.minimum_code;
    range = (int32_t)s_Waveform.maximum_code - minimum;

    if (display_points == 0U)
    {
        if (TjcHmi_GetComponentWidth("s0", &display_points) != 0U)
        {
            s_WaveDisplayPoints = display_points;
        }
        else
        {
            display_points = G_FLOW_WAVE_FALLBACK_POINTS;
        }
    }
    if (display_points > G_FLOW_WAVE_MAX_POINTS)
    {
        display_points = G_FLOW_WAVE_MAX_POINTS;
    }

    for (point = 0U; point < display_points; point++)
    {
        uint32_t source_numerator =
            (uint32_t)point *
            (uint32_t)(s_Waveform.point_count - 1U);
        uint16_t source_index = (uint16_t)(
            source_numerator / (display_points - 1U));
        uint32_t source_remainder =
            source_numerator % (display_points - 1U);
        uint16_t next_index =
            (source_index + 1U < s_Waveform.point_count)
            ? (uint16_t)(source_index + 1U)
            : source_index;
        int32_t interpolated =
            ((int32_t)s_Waveform.points[source_index] *
             (int32_t)((display_points - 1U) -
                       source_remainder) +
             (int32_t)s_Waveform.points[next_index] *
             (int32_t)source_remainder) /
            (int32_t)(display_points - 1U);

        if (range <= 0)
        {
            s_WaveDisplay[point] = G_FLOW_WAVE_VERTICAL_OFFSET;
        }
        else
        {
            int32_t centered = interpolated - minimum;
            int32_t original_height = (centered * 254) / range;
            int32_t scaled = original_height /
                             (int32_t)G_FLOW_WAVE_HEIGHT_DIVISOR +
                             (int32_t)G_FLOW_WAVE_VERTICAL_OFFSET;

            if (scaled < 0)
            {
                scaled = 0;
            }
            if (scaled > 254)
            {
                scaled = 254;
            }
            s_WaveDisplay[point] = (uint8_t)scaled;
        }
    }

    tjc_clear_wave("s0.id", 0);
    tjc_send_wave("s0.id",
                  0,
                  s_WaveDisplay,
                  display_points);
}

static uint32_t GSignalFlow_RoundPositive(float value)
{
    if (value <= 0.0f)
    {
        return 0UL;
    }

    if (value >= 4294967040.0f)
    {
        return 0xFFFFFFFFUL;
    }

    return (uint32_t)(value + 0.5f);
}

const GMeasurementResult *GSignalFlow_GetLatestMeasurement(void)
{
    return &s_Measurement;
}

uint8_t GSignalFlow_SetWaveformCycles(uint8_t cycles)
{
    if ((cycles != 1U) && (cycles != 3U))
    {
        return 0U;
    }

    s_WaveformCycles = cycles;
    return 1U;
}

const GMeasurementWaveform *GSignalFlow_GetLatestWaveform(void)
{
    return &s_Waveform;
}
